app/controllers/users_controller.rb

  def update
    #complete this method
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Pedr"], ["updated_at", "2018-04-17 17:04:53.963412"], ["id", 4]]

  def destroy
    #complete this method
    user = User.find(params[:id])
    if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]